# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application.kv_sp: Reading...
data.azuread_application.kv_sp: Read complete after 0s [id=/applications/570ae202-0655-482f-8aee-f885aa852685]
data.azuread_service_principal.aks_sp: Reading...
data.azuread_service_principal.aks_sp: Read complete after 1s [id=/servicePrincipals/f45036c4-af13-422c-8887-225805e2c777]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMTkxZTU1Ni0wODc4LTQzYzAtOTNiNS0xMjhhNWJmMWQ2OTk7b2JqZWN0SWQ9NjlhM2I0ZjgtYTExOS00NzM0LTk2NTgtZmNiZjdjNjM4M2U2O3N1YnNjcmlwdGlvbklkPTBmMDVlOWQ0LTU5MmItNDkxYS1iOWRhLTQ5YThiMjQyZDBjNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application.admin_app_reg will be created
  + resource "azuread_application" "admin_app_reg" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "dd-prod-admin-app"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)

      + web {
          + redirect_uris = [
              + "https://dd-prod-admin-app.azurewebsites.net/.auth/login/aad/callback",
            ]

          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # azuread_application_password.admin_app_secret will be created
  + resource "azuread_application_password" "admin_app_secret" {
      + application_id = (known after apply)
      + display_name   = "dd-prod-admin-app"
      + end_date       = (known after apply)
      + id             = (known after apply)
      + key_id         = (known after apply)
      + start_date     = (known after apply)
      + value          = (sensitive value)
    }

  # azuread_service_principal.admin_app_sp will be created
  + resource "azuread_service_principal" "admin_app_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_linux_web_app.admin_app will be updated in-place
  ~ resource "azurerm_linux_web_app" "admin_app" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_INSTRUMENTATIONKEY"             = (sensitive value)
          - "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          - "ApplicationInsightsAgent_EXTENSION_VERSION" = "~3"
        } -> (known after apply)
        id                                             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Web/sites/dd-prod-admin-app"
        name                                           = "dd-prod-admin-app"
      ~ tags                                           = {
            "costcenter"                                     = "altinn3"
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "hidden-link: /app-insights-conn-string"         = (sensitive value)
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
          ~ "hidden-link: /app-insights-resource-id"         = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/microsoft.insights/components/dd-prod-adminapp-ai" -> "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Insights/components/dd-prod-adminapp-ai"
            "solution"                                       = "apps"
        }
        # (25 unchanged attributes hidden)

      ~ auth_settings_v2 {
          ~ excluded_paths                          = [
              + "/health",
              + "/swagger",
            ]
            # (11 unchanged attributes hidden)

          ~ active_directory_v2 {
              ~ client_id                            = "b191e556-0878-43c0-93b5-128a5bf1d699" -> (known after apply)
              + client_secret_setting_name           = "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET"
                # (10 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ site_config {
          ~ minimum_tls_version                           = "1.2" -> "1.3"
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      + sticky_settings {
          + app_setting_names = [
              + "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET",
              + "WEBSITE_AUTH_AAD_ALLOWED_TENANTS",
              + "APPINSIGHTS_INSTRUMENTATIONKEY",
              + "APPLICATIONINSIGHTS_CONNECTION_STRING",
            ]
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-225-51"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.225.51"
      + id               = (known after apply)
      + name             = "admin-20-100-225-51"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.225.51"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-143"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.143"
      + id               = (known after apply)
      + name             = "admin-20-100-227-143"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.227.143"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-146"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.146"
      + id               = (known after apply)
      + name             = "admin-20-100-227-146"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.227.146"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-204"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.204"
      + id               = (known after apply)
      + name             = "admin-20-100-227-204"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.227.204"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-206"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.206"
      + id               = (known after apply)
      + name             = "admin-20-100-227-206"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.227.206"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-218"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.218"
      + id               = (known after apply)
      + name             = "admin-20-100-227-218"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.227.218"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-227-225"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.227.225"
      + id               = (known after apply)
      + name             = "admin-20-100-227-225"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.227.225"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-100-3-9"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.100.3.9"
      + id               = (known after apply)
      + name             = "admin-20-100-3-9"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.100.3.9"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-0-49"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.0.49"
      + id               = (known after apply)
      + name             = "admin-20-251-0-49"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.251.0.49"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-6-98"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.6.98"
      + id               = (known after apply)
      + name             = "admin-20-251-6-98"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.251.6.98"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-7-185"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.7.185"
      + id               = (known after apply)
      + name             = "admin-20-251-7-185"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.251.7.185"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-7-82"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.7.82"
      + id               = (known after apply)
      + name             = "admin-20-251-7-82"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.251.7.82"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.authz_whitelist["admin-20-251-94-60"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "authz_whitelist" {
      + end_ip_address   = "20.251.94.60"
      + id               = (known after apply)
      + name             = "admin-20-251-94-60"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/oed-authz-pg"
      + start_ip_address = "20.251.94.60"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-225-51"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.225.51"
      + id               = (known after apply)
      + name             = "admin-20-100-225-51"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.225.51"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-143"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.143"
      + id               = (known after apply)
      + name             = "admin-20-100-227-143"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.227.143"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-146"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.146"
      + id               = (known after apply)
      + name             = "admin-20-100-227-146"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.227.146"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-204"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.204"
      + id               = (known after apply)
      + name             = "admin-20-100-227-204"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.227.204"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-206"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.206"
      + id               = (known after apply)
      + name             = "admin-20-100-227-206"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.227.206"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-218"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.218"
      + id               = (known after apply)
      + name             = "admin-20-100-227-218"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.227.218"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-227-225"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.227.225"
      + id               = (known after apply)
      + name             = "admin-20-100-227-225"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.227.225"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-100-3-9"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.3.9"
      + id               = (known after apply)
      + name             = "admin-20-100-3-9"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.3.9"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-0-49"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.0.49"
      + id               = (known after apply)
      + name             = "admin-20-251-0-49"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.251.0.49"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-6-98"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.6.98"
      + id               = (known after apply)
      + name             = "admin-20-251-6-98"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.251.6.98"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-7-185"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.7.185"
      + id               = (known after apply)
      + name             = "admin-20-251-7-185"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.251.7.185"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-7-82"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.7.82"
      + id               = (known after apply)
      + name             = "admin-20-251-7-82"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.251.7.82"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["admin-20-251-94-60"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.94.60"
      + id               = (known after apply)
      + name             = "admin-20-251-94-60"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.251.94.60"
    }

  # azurerm_servicebus_namespace.dd_sb_ns will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "dd_sb_ns" {
        id                                  = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.ServiceBus/namespaces/dd-prod-sbn"
        name                                = "dd-prod-sbn"
        tags                                = {
            "costcenter" = "altinn3"
            "solution"   = "apps"
        }
        # (13 unchanged attributes hidden)

      ~ network_rule_set {
          ~ ip_rules                      = [
              + "20.100.225.51",
              + "20.100.227.143",
              + "20.100.227.146",
              + "20.100.227.204",
              + "20.100.227.206",
              + "20.100.227.218",
              + "20.100.227.225",
              + "20.100.3.9",
              + "20.251.0.49",
              + "20.251.6.98",
              + "20.251.7.185",
              + "20.251.7.82",
              + "20.251.94.60",
                # (10 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Web/sites/oed-feedpoller-func"
        name                                           = "oed-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 29 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/prod/altinn-digdir-oed-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_prod_altinn-digdir-oed-rg.tfstate.tfplan`